str1 = '''杜鑫宇 山西太原 山西大学 计算机类
侯懿轩 重庆 重庆大学 环化健康类
张烜睿 北京 北京交通大学 交通管理
杨子巍 广东深圳 深圳大学 自动化
宋子宁 青海兰州 兰州大学 物理学类
李子琛 湖南长沙 湖南大学 化学系
李政宏 天津大学 化工能源与生物医药类
白居贤 西南交大 车辆工程
高俊楼 山西太原 太原理工大学 自动化
刘瑞   北京 中国石油大学（北京） 自动化
聂思齐 北京 北京理工大学
靳学志 河南郑州 郑州大学 计算机
范育民 陕西西安 长安大学
杨舒程 江苏南京 西南交通大学 电子信息与技术
艾琛奇 江苏镇江 江苏大学 自动化
李文斌 广东珠海 暨南大学 电气工程及自动化
李奇学 陕西西安 长安大学 机械类
李容博 北京 北京科技大学 土木
周超超 四川成都 四川大学 计算机
郭鹏翔 陕西西安 西北工业大学 航空航天
梁雨琦 江苏南京 南京航空航天大学 应用化学
张馨艺 湖北武汉 武汉理工 经济学
陶星宇 天津 天津大学 工科试验班
张奕敏 北京 中国地质大学 地质类
左盛华 北京 中国矿业大学 计算机
智健恒 北京 中国地质大学 软件工程
侯昀伯 山西太原 中北大学 电气工程及自动化
李婧   天津 天津大学 医科
赵敏君 陕西西安 西北大学 过程装备及其控制
王楚涵 山西太原 山西师范大学 公费师范生'''
str1 = str1.replace(" ","")
str1 = str1.replace("\n","")
print(str1)
